// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

    // let x = 0 // введіть числове значення
    //    if (x != 0) {
    //     console.log('Вірно');
    // } else {
    //         console.log('Не вірно')
    // }


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

    // let time = 59  // Введіть час від 0 до 59 хв
    // if (time >=0 && time <15){
    //     console.log('перша чверть години');
    // } else if (time >= 15 && time < 30) {
    //     console.log('друга чверть години');
    // } else if (time >= 30 && time < 45) {
    //     console.log('третя чверть години');
    // } else if (time >= 45 && time <= 59) {
    //     console.log('четвертая чверть години');
    // } else {
    //     console.log('невірно введене значення');
    // }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

    // let day = 25 // Введіть день місяця від 1 до 31
    // if (day >=0 && day <=15){
    //     console.log('перша половина місяця');
    // } else if (day > 15 && day <= 31) {
    //     console.log('друга половина місяця');
    //   } else {
    //     console.log('невірно введене значення');
    // }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

//  let day = +prompt('введіть номер дня тижня')
// switch (day) {
//     case 1:
//         console.log('Monday');
//         break;
//     case 2:
//         console.log('Tuesday');
//         break;
//     case 3:
//         console.log('Wednesday');
//         break;
//     case 4:
//         console.log('Thursday');
//         break;
//     case 5:
//         console.log('Friday');
//         break;
//     case 6:
//         console.log('Saturday');
//         break;
//     case 7:
//         console.log('Sunday');
//         break;
//     default:
//         console.log('введено невірне значення');
// }

//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

    // let number1 = +prompt('Введіть число 1');
    // let number2 = +prompt('Введіть число 2');
    //
    // if (number1 > number2){
    //     console.log(number1);
    // } else if (number1 === number2) {
    //     console.log('введені рівні числа');
    //   } else if (number1 < number2){
    //     console.log(number2);
    //  } else {
    //     console.log('????????');
    // }

//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

    // let y = NaN || 'default';
    // console.log(y)
